{"format": "graph-model", "generatedBy": "2.17.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "875"}, {"size": "4"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/sbp_output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/sbp_output_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/dense_1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/dense_1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/dbp_output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/dbp_output_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_1_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_1_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "4"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_1_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_1_1/MaxPool1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_2_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_2_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_2_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_2_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_2_1/MaxPool1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/extract_pat_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/extract_pat_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/extract_pat_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_downsample_1/MaxPool1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense2_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "875"}, {"size": "4"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_2_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_1_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["input", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_1_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/extract_pat_1/strided_slice", "op": "StridedSlice", "input": ["input", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/extract_pat_1/strided_slice/stack", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/extract_pat_1/strided_slice/stack_1", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/extract_pat_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "end_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_1_1/convolution", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_1_1/convolution/ExpandDims", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_1_1/convolution/ExpandDims_1", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_1_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_downsample_1/MaxPool1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/extract_pat_1/strided_slice", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_downsample_1/MaxPool1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_1_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_1_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_downsample_1/MaxPool1d", "op": "MaxPool", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_downsample_1/MaxPool1d/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "1", "4", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "4", "1"]}}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_1_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_downsample_1/MaxPool1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_downsample_1/MaxPool1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_1_1/Relu", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense1_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_downsample_1/MaxPool1d/Squeeze", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense1_1/Cast/ReadVariableOp"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_1_1/batchnorm/mul_1", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense1_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense1_1/MatMul", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense1_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_1_1/MaxPool1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_1_1/batchnorm/add_1", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_1_1/MaxPool1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense1_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_1_1/MaxPool1d", "op": "MaxPool", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_1_1/MaxPool1d/ExpandDims"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense2_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense1_1/Relu", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense2_1/Cast/ReadVariableOp"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_1_1/MaxPool1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_1_1/MaxPool1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense2_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense2_1/MatMul", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense2_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_2_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_1_1/MaxPool1d/Squeeze", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_2_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_softmax_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_dense2_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_2_1/convolution", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_2_1/convolution/ExpandDims", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_2_1/convolution/ExpandDims_1", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_2_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_2_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_2_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_2_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_2_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/conv1d_2_1/Relu", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_2_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_2_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_2_1/batchnorm/mul_1", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_2_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_2_1/MaxPool1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/bn_2_1/batchnorm/add_1", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_2_1/MaxPool1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_2_1/MaxPool1d", "op": "MaxPool", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_2_1/MaxPool1d/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_2_1/MaxPool1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_2_1/MaxPool1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_multiply_1/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pool_2_1/MaxPool1d/Squeeze", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_softmax_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_multiply_1/Mul", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/pat_attention_multiply_1/Mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/transpose", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/Shape", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/strided_slice/stack", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/strided_slice/stack_1", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/strided_slice", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/strided_slice", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros/packed", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros_1/packed", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopControlInputs/_44", "op": "NoOp", "input": ["^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayV2_1", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_37", "op": "Enter", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayV2_1", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopControlInputs/_44"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvUGh5c0luZm9ybWVkX0NOTl9MU1RNX0F0dGVudGlvbl9EdWFsXzEvbHN0bV8xXzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_40", "op": "Enter", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopControlInputs/_44"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvUGh5c0luZm9ybWVkX0NOTl9MU1RNX0F0dGVudGlvbl9EdWFsXzEvbHN0bV8xXzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_35", "op": "Enter", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/Max", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopControlInputs/_44"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvUGh5c0luZm9ybWVkX0NOTl9MU1RNX0F0dGVudGlvbl9EdWFsXzEvbHN0bV8xXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_34", "op": "Enter", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/loop_counter", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopControlInputs/_44"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvUGh5c0luZm9ybWVkX0NOTl9MU1RNX0F0dGVudGlvbl9EdWFsXzEvbHN0bV8xXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_38", "op": "Enter", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopControlInputs/_44"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvUGh5c0luZm9ybWVkX0NOTl9MU1RNX0F0dGVudGlvbl9EdWFsXzEvbHN0bV8xXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_39", "op": "Enter", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros_1", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopControlInputs/_44"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvUGh5c0luZm9ybWVkX0NOTl9MU1RNX0F0dGVudGlvbl9EdWFsXzEvbHN0bV8xXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_36", "op": "Enter", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/time", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopControlInputs/_44"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvUGh5c0luZm9ybWVkX0NOTl9MU1RNX0F0dGVudGlvbl9EdWFsXzEvbHN0bV8xXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_41", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_17", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopControlInputs/_44"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvUGh5c0luZm9ybWVkX0NOTl9MU1RNX0F0dGVudGlvbl9EdWFsXzEvbHN0bV8xXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_42", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_18", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopControlInputs/_44"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvUGh5c0luZm9ybWVkX0NOTl9MU1RNX0F0dGVudGlvbl9EdWFsXzEvbHN0bV8xXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_43", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_19", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopControlInputs/_44"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvUGh5c0luZm9ybWVkX0NOTl9MU1RNX0F0dGVudGlvbl9EdWFsXzEvbHN0bV8xXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_48", "op": "Merge", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_37", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/next_iteration/_72"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_51", "op": "Merge", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_40", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/next_iteration/_75"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_46", "op": "Merge", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_35", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/next_iteration/_70"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_45", "op": "Merge", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_34", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/next_iteration/_69"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_49", "op": "Merge", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_38", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/next_iteration/_73"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_50", "op": "Merge", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_39", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/next_iteration/_74"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_47", "op": "Merge", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_36", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/next_iteration/_71"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/cond/_32/input_control_node/_120", "op": "NoOp", "input": ["^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_41", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_42", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/enter/_43", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_45", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_46", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_47", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_48", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_49", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_50", "^StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_51"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/cond/_32/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_45", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_46", "^Func/StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/cond/_32/input_control_node/_120"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/cond/_32/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/Less/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/cond/_32/input_control_node/_120"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/cond/_32/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_47", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/cond/_32/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/cond/_32/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/cond/_32/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/Less_1", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/cond/_32/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/Less"]}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopCond/_52", "op": "LoopCond", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/cond/_32/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LogicalAnd"]}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/Max_switch/_54", "op": "Switch", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_46", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopCond/_52"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/loop_counter_switch/_53", "op": "Switch", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_45", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopCond/_52"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros_1_switch/_58", "op": "Switch", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_50", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopCond/_52"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayUnstack/TensorListFromTensor_switch/_59", "op": "Switch", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_51", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopCond/_52"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/time_switch/_55", "op": "Switch", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_47", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopCond/_52"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/zeros_switch/_57", "op": "Switch", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_49", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopCond/_52"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/TensorArrayV2_1_switch/_56", "op": "Switch", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/merge/_48", "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/LoopCond/_52"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/exit/_62", "op": "Exit", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/Max_switch/_54"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/exit/_61", "op": "Exit", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/loop_counter_switch/_53"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/loop_body_control/_60", "op": "Identity", "input": ["StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/StatefulPartitionedCall/PhysInformed_CNN_LSTM_Attention_Dual_1/lstm_1_1/while/loop_counter_switch/_53:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": 